export const ACII = () => {
  return `
 ╔═══════════════════════════════════════════════════════════════════════════════════╗
║ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░  ║
 ║  ░░  ██████╗  ██████╗ ██████╗ ████████╗███████╗ ██████╗ ██╗     ██╗ ██████╗   ░░  ║
 ║  ░░  ██╔══██╗██╔═══██╗██╔══██╗╚══██╔══╝██╔════╝██╔═══██╗██║     ██║██╔═══██╗  ░░  ║
 ║  ░░  ██████╔╝██║   ██║██████╔╝   ██║   █████╗  ██║   ██║██║     ██║██║   ██║  ░░  ║
 ║  ░░  ██╔═══╝ ██║   ██║██╔══██╗   ██║   ██╔══╝  ██║   ██║██║     ██║██║   ██║  ░░  ║
 ║  ░░  ██║     ╚██████╔╝██║  ██║   ██║   ██║     ╚██████╔╝███████╗██║╚██████╔╝  ░░  ║
 ║  ░░  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝   ╚═╝      ╚═════╝ ╚══════╝╚═╝ ╚═════╝   ░░  ║
║ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░  ║
 ╚═══════════════════════════════════════════════════════════════════════════════════╝ v1.0`;
};

export const commands = {
  help: ` ▶️ Available commands:
    about     - Learn about me
    projects  - View my projects  
    skills    - Check my skills
    contact   - Get in touch
    clear     - Clear terminal
    whoami    - Display user info
    ls        - List directory contents
    cat       - Read file contents`,

  about: `Hi! I'm a Frontend Developer passionate about React and modern web technologies.

    Recently completed:
    ✓ Modern Tech Store (React + React Router + Tailwind)
    ✓ Building responsive SPAs
    ✓ Focused on performance and user experience
    ✓ Always learning and improving my skills
    
    → Advanced React patterns
    → Portfolio old-school terminal.`,

  projects: `📁 My Projects:
    
    [1] modern-tech-store/
        ├── 🛍️ Tect-Store SPA
        ├── ⚛️ React + React Router
        ├── 🎨 Tailwind CSS
        └── 🔗 Live Demo | Code
    
    [2] task-manager/
        ├── ✅ Todo application
        ├── 📱 Responsive design
        ├── 💾 Local storage
        └── 🔗 Live Demo | Code
    
    [3] weather-app/
        ├── 🌤️ Weather dashboard
        ├── 🌍 API integration
        ├── 📍 Location-based
        └── 🔗 Live Demo | Code
        👉Type the number of the project for the open :
        `,

  skills: `🚀 Technical Skills:
    
    Frontend:
    ███████████████████████░░░░░░░░░░░ React (70%)
    █████████████████████████░░░░░░░░░ JavaScript (75%)
    █████████████████████████░░░░░░░░░ Tailwind CSS (75%)
    █████████████████████░░░░░░░░░░░░░ React Router (60%)
    ███████████████████████████░░░░░░░ HTML/CSS (80%)
    
    Tools:
    ██████████████████░░░░░░░░░░░░░░░░ Git (50%)
    ██████████████████████░░░░░░░░░░░░ VS Code (60%)
    ████████████████████░░░░░░░░░░░░░░ npm/yarn (55%)`,

  contact: `📧 Contact Information:
    
    Email: measreaksa0@gmail.com
    Phone: --------------
    Location: Phnom Penh
    
    Social:
    🐙 GitHub: https://github.com/SA1946
    💼 LinkedIn: linkedin.com/in/reaksa-meas
    
    Status: Available for opportunities!`,

  whoami: `Synsa@portfolio:> whoami
    Frontend Developer
    currentFocus on "Dynamic UI Components",
    Problem Solver
    Coffee Lover ☕`,

  ls: `total 5
    🧾  about.txt
    🧾  projects/
    🧾  skills.json
    🧾  contact.md
    🧾  github.com
    🧾  resume.pdf`,

  github: "Let's check the new tab opened with GitHub profile",
  resume: "CV_Measreaksa.pdf have been downloaded ",
  clear: "Clear terminal",
};
